team/case4/pimple/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (0 0 0) // 0
  (2 0 0) // 1
  (2.5 0 0) // 2
  (4 0 0) // 3
  (4 0.999048 -0.0436194) // 4 
  (8 1.24881 -0.0545242) // 5
  (8 1.9981 -0.0872388) // 6
  (4 1.9981 -0.0872388) // 7
  (2.5 1.9981 -0.0872388) // 8
  (2 1.49857 -0.0654291) // 9
  (2 0.999048 -0.0436194) // 10
  (0 0.999048 -0.0436194) // 11 
  (2.5 0.999048 -0.0436194) // 12
  
  (4 0.999048 0.0436194) // 13
  (8 1.24881 0.0545242) // 14
  (8 1.9981 0.0872388) // 15
  (4 1.9981 0.0872388) // 16
  (2.5 1.9981 0.0872388) // 17
  (2 1.49857 0.0654291) // 18
  (2 0.999048 0.0436194) //19
  (0 0.999048 0.0436194) //20
  (2.5 0.999048 0.0436194) //21
);

blocks
(
    hex (0 1 10 11 0 1 19 20) (20 18 1) simpleGrading (1 1 1)
    hex (1 2 12 10 1 2 21 19) (5 18 1) simpleGrading (1 1 1)
    hex (2 3 4 12 2 3 13 21) (15 18 1) simpleGrading (1 1 1)
    hex (10 12 8 9 19 21 17 18) (5 18 1) simpleGrading (1 1 1)
    hex (12 4 7 8 21 13 16 17) (15 18 1) simpleGrading (1 1 1)
    hex (4 5 6 7 13 14 15 16) (40 18 1) simpleGrading (1 1 1)
);

edges
(
  spline 4 5
  (
    (5 0.999048 -.0436194)
    (5.5 .999048 -.0436194)
    (6 .999048 -.0436194)
    (7.5 1.24881 -.0545242)
    (7.75 1.24881 -.0545242)
    (8 1.24881 -.0545242)
  )
  spline 13 14
  (
    (5 0.999048 .0436194)
    (5.5 .999048 .0436194)
    (6 .999048 .0436194)
    (7.5 1.24881 .0545242)
    (7.75 1.24881 .0545242)
    (8 1.24881 .0545242)
  )
  /*arc 6 15 (8 2 0)
  arc 7 16 (8 2 0)
  arc 6 15 (8 2 0)
  arc 6 15 (8 2 0)
  
  arc 6 15 (8 2 0)
  arc 6 15 (8 2 0)
  arc 6 15 (8 2 0)
  arc 6 15 (8 2 0)*/
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	    (0 11 20 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (5 6 15 14)
        );
    }
    centerline
    {
	type symmetry;
	faces
	(
	  (0 1 1 0)
	  (1 2 2 1)
	  (2 3 3 2)
	  );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (20 11 10 19)
	    (9 10 19 18)
	    (18 9 8 17)
	    (17 8 7 16)
	    (16 7 6 15)
	    (4 5 14 13)
	    (3 4 13 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 10 11)
	    (1 2 12 10)
	    (2 3 4 12)
	    (10 12 8 9)
	    (12 4 7 8)
	    (4 5 6 7)
	    (0 1 19 20)
	    (1 2 21 19)
	    (2 3 13 21)
	    (19 21 17 18)
	    (21 13 16 17)
	    (13 14 15 16)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
