team/case4/pimple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          18;
        startFace       3484;
    }
    outlet
    {
        type            patch;
        nFaces          18;
        startFace       3502;
    }
    centerline
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          0;
        startFace       3520;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          156;
        startFace       3520;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3600;
        startFace       3676;
    }
)

// ************************************************************************* //
